/*************************
1.有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
**********************/

//#include<stdio.h>
//int main()
//{
//
//	int i = 1, j = 1,k = 1;
//	for(i = 1; i < 05; i++)
//	{
//		for(j  =1; j < 5 ; j++)
//		{
//			for(k = 1; k < 5; k++)
//			{
//				if(i!=j && j!= k && i!=k)
//					printf("%d%d%d\n",i,j,k);
//			}
//		}
//	}
//
//	return 0;
//}


/*************************
C 练习实例2
C 语言经典100例 C 语言经典100例
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
**********************/
//#include<stdio.h>
//int main()
//{
//	double a = 10 * 0.1;
//	double b = (20 - 10) * 0.075;
//	double c = (40 - 20) * 0.05;
//	double d = (60 - 40) * 0.03;
//	double e = (100 - 60) * 0.015;
//	double profit = 0;
//
//	scanf("%lf",&profit);
//	if(profit < 0)
//	{
//		printf("erro");
//		return -1;
//	}
//	if(profit <= 10)
//	{
//		printf("%lf\n", profit * 0.1);
//	}
//	else if	(profit <= 20)
//	{
//		printf("%lf\n", (profit - 10) * 0.075 + a);
//	}
//	else if(profit <= 40)
//	{
//		printf("%lf\n", (profit - 20) * 0.05 + a + b);
//	}
//	else if(profit <= 60)
//	{
//		printf("%lf\n", (profit - 40) * 0.03 + a + b + c);
//	}
//	else if(profit <= 100)
//	{
//		printf("%lf\n", (profit - 60) * 0.015 + a + b + c + d);
//	}
//	else
//	{
//		printf("%lf\n", (profit - 100) * 0.01 + a + b + c + d);
//	}
//	return 0;
//}



/****************************************
C 练习实例3
C 语言经典100例 C 语言经典100例
题目：一个整数，它加上100后是一个完全平方数，再加上268又是一个完全平方数，请问该数是多少？
程序分析：在10万以内判断，先将该数加上100后再开方，再将该数加上268后再开方，如果开方后的结果满足如下条件，即是结果。
***************************************/
//
//#include<stdio.h>
//#include<math.h>
//int main()
//{
//	double a = 1;
//	for(a = 1; a < 1000000; a++)
//	{
//		if((sqrt(a + 100) - (int)sqrt(a + 100)) == 0 && (sqrt(a + 268) - (int)sqrt(a + 268)) == 0 )
//		{
//			printf("%.0lf\n",a);
//
//		}
//
//	}
//
//	return 0;
//	
//
//}
//
//#include <stdio.h>
//#include "math.h"
//
//int main() {
//    long int i,x,y;
//    for (i=1;i<100000;i++) {
//        x=sqrt(i+100); // x为加上100后开方后的结果
//        y=sqrt(i+268); // y为再加上168后开方后的结果
//        if(x*x==i+100 && y*y==i+268){ //如果一个数的平方根的平方等于该数，这说明此数是完全平方数
//            printf("\n%ld\n",i);
//        }
//    }
//}


/********************************************
C 练习实例4
C 语言经典100例 C 语言经典100例
题目：输入某年某月某日，判断这一天是这一年的第几天？
程序分析：以3月5日为例，应该先把前两个月的加起来，然后再加上5天即本年的第几天，特殊情况，闰年且输入月份大于3时需考虑多加一天。

***********************************************/
//#include<stdio.h>
//#include<math.h>
//int isleapyear(int y);
//int main()
//{
//	int i = 0;
//	int sum = 0;
//	int arr[12] = {31,28,31,30,31,30,31,31,30,31,30,31};
//	int isleapyearflag = 0;
//	int ymd = 0;
//	int y = 0, m = 0, d = 0;
//	//输入8位长度的年月日：如：20161104。认输入的是合法日期
//
//	scanf("%d",&ymd);
//	//分离出年月日
//	y = ymd/10000;
//	m = (ymd - y * 10000)/100;
//	d = ymd - y  * 10000 - m * 100;
//	//判断平闰年
//	isleapyearflag = isleapyear(y);
//	if(1 == isleapyearflag && m > 2)
//	{
//		for(i = 0; i < m - 1; i++)
//		{
//			sum += arr[i];
//		}
//		printf("%d\n", sum + d + 1);//如果是闰年，并且月份大于2，要多加一天。
//	}
//	else
//	{
//		for(i = 0; i < m - 1; i++)
//		{
//			sum += arr[i];
//		}
//		printf("%d\n", sum + d);
//	}
//	return 0;
//}
//
//int isleapyear(int y)
//{
//	if(y%400 == 0  || y%4==0 && y%100 != 0)//判断闰年, 注意别把%号写成了/号。
//	{
//		return 1;//如果是闰年就返回1
//	}
//	else
//	{
//		return 0;//平年返回0
//	}
//}



/***********************************************************************************
C 练习实例5
C 语言经典100例 C 语言经典100例
题目：输入三个整数x,y,z，请把这三个数由小到大输出。
程序分析：我们想办法把最小的数放到x上，先将x与y进行比较，如果x>y则将x与y的值进行交换，
然后再用x与z进行比较，如果x>z则将x与z的值进行交换，这样能使x最小。
***********************************************************************************/

//基本方法，罗列所有可能
//#include<stdio.h>
//
//int main()
//{
	//int x, y, z;
	//scanf("%d%d%d", &x, &y, &z);
//	if(x >= y)
//	{
//		if(z >= x)
//		{
//			printf("%d\t%d\t%d\n", y, x, z);
//		}
//		else if(z >= y)
//		{
//			printf("%d\t%d\t%d\n", y, z, x);
//		}
//		else
//		{
//			printf("%d\t%d\t%d\n", z, y, x);
//		}
//	}
//	else
//	{
//		if(x >= z)
//		{
//			printf("%d\t%d\t%d\n", z, x, y);
//		}
//		else if(z >= y)
//		{
//			printf("%d\t%d\t%d\n", x, y, z);
//		}
//		else
//		{
//			printf("%d\t%d\t%d\n", x, z, y);
//		}
//	}
//	return 0;
//}


//冒泡排序的方法。
//#include<stdio.h>
//void swap(int *a, int *b);
//int  main()
//{
//	int x, y, z;
//	scanf("%d%d%d", &x, &y, &z);
//	
//	if(x > y)//注意三个if的顺序
//	{
//		swap(&x, &y);
//	}
//	if(x > z)//前两次比较后，x一定为最小的，然后再确定第二位和第三位。
//	{
//		swap(&x, &z);
//	}
//	if(&y > &z)
//	{
//		swap(&y, &z);
//	}
//
//	printf("%d,%d,%d\n", x, y, z);
//}
//void swap(int *a, int *b)
//{
//	int   t;
//	t  = *a;
//	*a = *b;
//	*b =  t;
//}



/******************************************************
C 练习实例6
C 语言经典100例 C 语言经典100例
题目：用*号输出字母C的图案。
程序分析：可先用'*'号在纸上写出字母C，再分行输出。
********************************************************/
//#include<stdio.h>
//int main()
//{
//    printf(" ****\n");
//    printf(" *\n");
//    printf(" * \n");
//    printf(" ****\n");
//	return 0;
//}



/******************************************************
C 练习实例7
C 语言经典100例 C 语言经典100例
题目：输出特殊图案，请在c环境中运行，看一看，Very Beautiful!
程序分析：字符共有256个。不同字符，图形不一样。
VC6.0下出现中文乱码(原因+解决方法):
176的16进制是B0，219的16进制是DB，0xB0DB是"佰"字的内码，所以输出的就是"佰"了。
主要原因是文件信息的代码页不同，我们所使用的操作系统中文状态下的代码页，
要显示扩展的ASCII码需要在437 OEM-美国这个下面显示，这样就可以显示出你所希望的。
具体修改控制台的默认代码页步骤如下：
1.点击运行界面左上角标题栏图标【c:\】，选择默认值一项
2.修改默认代码页，936（ANSI/OEM-简体中文GBK）为437 OEM-美国
3、关闭后重新运行一下即可
********************************************************/

//程序源代码：
//  Created by www.runoob.com on 15/11/9.
//  Copyright © 2015年 菜鸟教程. All rights reserved.
//

//#include<stdio.h>
//int main()
//{
//    char a=176,b=219;
//    printf("%c%c%c%c%c\n",b,a,a,a,b);
//    printf("%c%c%c%c%c\n",a,b,a,b,a);
//    printf("%c%c%c%c%c\n",a,a,b,a,a);
//    printf("%c%c%c%c%c\n",a,b,a,b,a);
//    printf("%c%c%c%c%c\n",b,a,a,a,b);
//    return 0;
//}

/********************************************************
C 练习实例8
C 语言经典100例 C 语言经典100例
题目：输出9*9口诀。
程序分析：分行与列考虑，共9行9列，i控制行，j控制列。

********************************************************/
//#include<stdio.h>
//int main()
//{
//	int i, j;
//	//for(i = 9; i > 0; i--)
//	for(i = 0; i <= 9; i++)
//	{
//		for(j =1; j <= i; j++)
//		{
//			printf("%d*%d=%d\t", i, j, i*j);
//		}
//		printf("\n");
//	}
//	return 0;
//}



/********************************************************
C 语言经典100例 C 语言经典100例
题目：要求输出国际象棋棋盘。
程序分析：国际象棋棋盘由64个黑白相间的格子组成，分为8行*8列。用i控制行，
j来控制列，根据i+j的和的变化来控制输出黑方格，还是白方格。
如果出现乱码情况请参考本博客【C 练习实例7】的解决方法。
********************************************************/

//#include<stdio.h>
//
//int main()
//{
//    int i,j;
//    for(i=0;i<8;i++)
//    {
//        for(j=0;j<8;j++)
//            if((i+j)%2==0)
//                printf("%c%c",219,219);
//            else printf("  ");
//        printf("\n");
//    }
//    return 0;
//}


/********************************

C 练习实例10
C 语言经典100例 C 语言经典100例
题目：打印楼梯，同时在楼梯上方打印两个笑脸。
程序分析：用 ASCII 1 来输出笑脸；用i控制行，j来控制列，j根据i的变化来控制输出黑方格的个数。
如果出现乱码情况请参考本博客【C 练习实例7】的解决方法。
*********************************/

//  Created by www.runoob.com on 15/11/9.
//  Copyright © 2015年 菜鸟教程. All rights reserved.
//

//#include<stdio.h>

//int main()
//{
//    int i,j;
//    printf("\1\1\n"); /*输出两个笑脸*/
//    for(i=1;i<11;i++)
//    {
//        for(j=1;j<=i;j++)
//            printf("%c%c",219,219);
//        printf("\n");
//    }
//    return 0;
//}