/*************************
1.有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
**********************/

//#include<stdio.h>
//int main()
//{
//
//	int i = 1, j = 1,k = 1;
//	for(i = 1; i < 05; i++)
//	{
//		for(j  =1; j < 5 ; j++)
//		{
//			for(k = 1; k < 5; k++)
//			{
//				if(i!=j && j!= k && i!=k)
//					printf("%d%d%d\n",i,j,k);
//			}
//		}
//	}
//
//	return 0;
//}


/*************************
C 练习实例2
C 语言经典100例 C 语言经典100例
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
**********************/
//#include<stdio.h>
//int main()
//{
//	double a = 10 * 0.1;
//	double b = (20 - 10) * 0.075;
//	double c = (40 - 20) * 0.05;
//	double d = (60 - 40) * 0.03;
//	double e = (100 - 60) * 0.015;
//	double profit = 0;
//
//	scanf("%lf",&profit);
//	if(profit < 0)
//	{
//		printf("erro");
//		return -1;
//	}
//	if(profit <= 10)
//	{
//		printf("%lf\n", profit * 0.1);
//	}
//	else if	(profit <= 20)
//	{
//		printf("%lf\n", (profit - 10) * 0.075 + a);
//	}
//	else if(profit <= 40)
//	{
//		printf("%lf\n", (profit - 20) * 0.05 + a + b);
//	}
//	else if(profit <= 60)
//	{
//		printf("%lf\n", (profit - 40) * 0.03 + a + b + c);
//	}
//	else if(profit <= 100)
//	{
//		printf("%lf\n", (profit - 60) * 0.015 + a + b + c + d);
//	}
//	else
//	{
//		printf("%lf\n", (profit - 100) * 0.01 + a + b + c + d);
//	}
//	return 0;
//}



/****************************************
C 练习实例3
C 语言经典100例 C 语言经典100例
题目：一个整数，它加上100后是一个完全平方数，再加上268又是一个完全平方数，请问该数是多少？
程序分析：在10万以内判断，先将该数加上100后再开方，再将该数加上268后再开方，如果开方后的结果满足如下条件，即是结果。
***************************************/
//
//#include<stdio.h>
//#include<math.h>
//int main()
//{
//	double a = 1;
//	for(a = 1; a < 1000000; a++)
//	{
//		if((sqrt(a + 100) - (int)sqrt(a + 100)) == 0 && (sqrt(a + 268) - (int)sqrt(a + 268)) == 0 )
//		{
//			printf("%.0lf\n",a);
//
//		}
//
//	}
//
//	return 0;
//	
//
//}
//
//#include <stdio.h>
//#include "math.h"
//
//int main() {
//    long int i,x,y;
//    for (i=1;i<100000;i++) {
//        x=sqrt(i+100); // x为加上100后开方后的结果
//        y=sqrt(i+268); // y为再加上168后开方后的结果
//        if(x*x==i+100 && y*y==i+268){ //如果一个数的平方根的平方等于该数，这说明此数是完全平方数
//            printf("\n%ld\n",i);
//        }
//    }
//}


/********************************************
C 练习实例4
C 语言经典100例 C 语言经典100例
题目：输入某年某月某日，判断这一天是这一年的第几天？
程序分析：以3月5日为例，应该先把前两个月的加起来，然后再加上5天即本年的第几天，特殊情况，闰年且输入月份大于3时需考虑多加一天。

***********************************************/
#include<stdio.h>
int main()
{
	
}



